arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/clock/S32K144/fsl_clock_S32K144.c
/*
 * Copyright (c) 2013 - 2015, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_clock_S32K144.h"
#include "fsl_clock_manager.h"
#include "fsl_device_registers.h"
/*
 * README:
 * This file should provide these APIs:
 * 1. APIs to get the frequency of output clocks in Reference Manual ->
 * Chapter Clock Distribution -> Figure Clocking diagram.
 * 2. APIs for IP modules listed in Reference Manual -> Chapter Clock Distribution
 * -> Module clocks.
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* This frequency values should be set by different boards. */
/* SIM */
uint32_t g_TClkFreq[NUMBER_OF_TCLK_INPUTS];      /* TCLKx clocks    */

/* RTC */
uint32_t g_RtcClkInFreq;                         /* RTC CLKIN clock */

/* SCG */
uint32_t g_xtal0ClkFreq;                         /* EXTAL0 clock    */

/*******************************************************************************
 * PROTOTYPES
 ******************************************************************************/

static clock_manager_error_code_t CLOCK_SYS_GetScgClockFreq(clock_names_t clockName, uint32_t * frequency);
static clock_manager_error_code_t CLOCK_SYS_GetSimClockFreq(clock_names_t clockName, uint32_t * frequency);
static clock_manager_error_code_t CLOCK_SYS_GetPccClockFreq(clock_names_t clockName, uint32_t * frequency);
static uint32_t CLOCK_SYS_GetPeripheralClock(clock_names_t clockName, scg_async_clock_type_t divider);
static scg_system_clock_mode_t CLOCK_SYS_GetCurrentRunMode(SMC_Type * smc_base);
static bool CLOCK_SYS_SwitchSystemClock(scg_system_clock_src_t to_clk);

/*******************************************************************************
 * Code
 ******************************************************************************/

 
/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_SetConfiguration
 * Description   : This function sets the system to target configuration, it
 * only sets the clock modules registers for clock mode change, but not send
 * notifications to drivers.
 *
 *END**************************************************************************/
clock_manager_error_code_t CLOCK_SYS_SetConfiguration(clock_manager_user_config_t const* config)
{
    clock_manager_error_code_t result;
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(config);
#endif

    /* Set SCG settings. */
    if(STATUS_SCG_SUCCESS != CLOCK_SYS_SetScgConfiguration(&config->scgConfig)){
        result = CLOCK_MANAGER_INVALID_PARAM;
    } else {
        result = CLOCK_MANAGER_SUCCESS;
    }

    /* Set PCC settings. */
    CLOCK_SYS_SetPccConfiguration(&config->pccConfig);

    /* Set SIM settings. */
    CLOCK_SYS_SetSimConfiguration(&config->simConfig);

    return result;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_SetScgConfiguration
 * Description   : This function configures the SCG blocks
 *
 *END**************************************************************************/
scg_status_t CLOCK_SYS_SetScgConfiguration(const scg_config_t *scgConfig)
{
    scg_status_t status;
    uint32_t timeout;
    scg_system_clock_config_t current_config;
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(scgConfig);
#endif

    status = STATUS_SCG_SUCCESS;

    if (scgConfig){

        /* Get CURRENT mode configuration */
        SCG_HAL_GetSystemClockConfig(SCG, SCG_SYSTEM_CLOCK_MODE_CURRENT, &current_config);

        /* Configure SIRC. */
        if (scgConfig->sircConfig.initialize) {

            /* Check and switch to alternate */
            if ( current_config.src == SCG_SYSTEM_CLOCK_SRC_SIRC ) {
                CLOCK_SYS_SwitchSystemClock(scgConfig->clockModeConfig.alternateClock);
            }

            /* Disable the SIRC. */
            status |= SCG_HAL_DeinitSirc(SCG);

            /* Setup SIRC. */
            status |= SCG_HAL_InitSirc(SCG, &(scgConfig->sircConfig));

            /* Wait for SIRC to initialize - typical 6us*/
            /* f core = max 112mhz=>9ns/cycle, ~26 cycles per loop=> 26 loops*/
            timeout = 26;
            while((SCG_HAL_GetSircFreq(SCG) == 0) && (timeout > 0)){
                timeout--;
            }

            /* Revert from alternate */
            if ( current_config.src == SCG_SYSTEM_CLOCK_SRC_SIRC ) {
                status |= CLOCK_SYS_SwitchSystemClock( SCG_SYSTEM_CLOCK_SRC_SIRC ) ?
                          STATUS_SCG_SUCCESS : STATUS_SCG_FAILED;
            }

            #ifdef DEV_ERROR_DETECT
                DEV_ASSERT(STATUS_SCG_SUCCESS == status);
            #endif
        }

        /* Configure FIRC. */
        if (scgConfig->fircConfig.initialize) {

            /* Check and switch to alternate */
            if ( current_config.src == SCG_SYSTEM_CLOCK_SRC_FIRC ) {
                CLOCK_SYS_SwitchSystemClock(scgConfig->clockModeConfig.alternateClock);
            }

