arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/clock/S32K144/fsl_clock_S32K144.c
            /* Disable the FIRC. */
            status |= SCG_HAL_DeinitFirc(SCG);

            /* Setup FIRC. */
            status |= SCG_HAL_InitFirc(SCG, &(scgConfig->fircConfig));

            /* Revert from alternate */
            if ( current_config.src == SCG_SYSTEM_CLOCK_SRC_FIRC ) {
                status |= CLOCK_SYS_SwitchSystemClock( SCG_SYSTEM_CLOCK_SRC_FIRC ) ?
                          STATUS_SCG_SUCCESS : STATUS_SCG_FAILED;
            }

            #ifdef DEV_ERROR_DETECT
                DEV_ASSERT(STATUS_SCG_SUCCESS == status);
            #endif
        }

        /* Configure SOSC. */
        if (scgConfig->soscConfig.initialize) {

            /* Check and switch to alternate */
            if ( current_config.src == SCG_SYSTEM_CLOCK_SRC_SYS_OSC ) {
                CLOCK_SYS_SwitchSystemClock(scgConfig->clockModeConfig.alternateClock);
            }

            /* Disable the SOSC. */
            status |= SCG_HAL_DeinitSysOsc(SCG);

            /* Setup System OSC. */
            status |= SCG_HAL_InitSysOsc(SCG, &(scgConfig->soscConfig));

            /* Wait for System OSC to initialize - max 750ms*/
            /* f core = max 112mhz=>9ns/cycle, ~26 cycles per loop=> 3205000 loops*/
            timeout = 3205000;
            while((SCG_HAL_GetSysOscFreq(SCG) == 0) && (timeout > 0)){
                timeout--;
            }

            /* Revert from alternate */
            if ( current_config.src == SCG_SYSTEM_CLOCK_SRC_SYS_OSC ) {
                status |= CLOCK_SYS_SwitchSystemClock( SCG_SYSTEM_CLOCK_SRC_SYS_OSC ) ?
                          STATUS_SCG_SUCCESS : STATUS_SCG_FAILED;
            }

            #ifdef DEV_ERROR_DETECT
                DEV_ASSERT(STATUS_SCG_SUCCESS == status);
            #endif
        }

        /* Configure SPLL. */
        if (scgConfig->spllConfig.initialize) {

            /* Check and switch to alternate */
            if ( current_config.src == SCG_SYSTEM_CLOCK_SRC_SYS_PLL ) {
                CLOCK_SYS_SwitchSystemClock(scgConfig->clockModeConfig.alternateClock);
            }

            /* Disable the SPLL. */
            status |= SCG_HAL_DeinitSysPll(SCG);

            /* Setup SPLL. */
            status |= SCG_HAL_InitSysPll(SCG, &(scgConfig->spllConfig));

            /* Revert from alternate */
            if ( current_config.src == SCG_SYSTEM_CLOCK_SRC_SYS_PLL ) {
                status |= CLOCK_SYS_SwitchSystemClock( SCG_SYSTEM_CLOCK_SRC_SYS_PLL ) ?
                          STATUS_SCG_SUCCESS : STATUS_SCG_FAILED;
            }

            #ifdef DEV_ERROR_DETECT
                DEV_ASSERT(STATUS_SCG_SUCCESS == status);
            #endif
        }

        /* Configure RTC. */
        if (scgConfig->rtcConfig.initialize) {
            /* RTC Clock settings. */
            SCG_HAL_SetRtcClkInFreq(SCG, scgConfig->rtcConfig.rtcClkInFreq);
        }

        /* Configure SCG clock modes. */
        if (scgConfig->clockModeConfig.initialize) {
            /* Configure SCG clock modes */
            SCG_HAL_SetSystemClockConfig(SCG, SCG_SYSTEM_CLOCK_MODE_RUN,   &(scgConfig->clockModeConfig.rccrConfig));
            SCG_HAL_SetSystemClockConfig(SCG, SCG_SYSTEM_CLOCK_MODE_VLPR,  &(scgConfig->clockModeConfig.vccrConfig));
            SCG_HAL_SetSystemClockConfig(SCG, SCG_SYSTEM_CLOCK_MODE_HSRUN, &(scgConfig->clockModeConfig.hccrConfig));
        }

    }

    return status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_SetPccConfiguration
 * Description   : This function configures the PCC block
 *
 *END**************************************************************************/
void CLOCK_SYS_SetPccConfiguration(const pcc_config_t *peripheralClockConfig)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(peripheralClockConfig);
#endif
    PCC_HAL_SetPeripheralClockConfig(PCC, peripheralClockConfig);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_SetSimConfiguration
 * Description   : This function configures the PCC block
 *
 *END**************************************************************************/
void CLOCK_SYS_SetSimConfiguration(const sim_clock_config_t *simClockConfig)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(simClockConfig);
#endif
    uint8_t i;

    /* ClockOut settings. */
    if (simClockConfig->clockOutConfig.initialize){
        SIM_HAL_SetClkOutSel(SIM, simClockConfig->clockOutConfig.source);
    }

    /* Low Power Clock settings. */
    if (simClockConfig->lpoClockConfig.initialize){
        SIM_HAL_SetLpoClocks(SIM, simClockConfig->lpoClockConfig);
    }

    /* Platform Gate Clock settings. */
    if (simClockConfig->platGateConfig.initialize){
        SIM_HAL_SetMscmClockGate(SIM, simClockConfig->platGateConfig.enableMscm);
        SIM_HAL_SetMpuClockGate(SIM,  simClockConfig->platGateConfig.enableMpu);
        SIM_HAL_SetDmaClockGate(SIM,  simClockConfig->platGateConfig.enableDma);
    }

    /* TCLK Clock settings. */
    if (simClockConfig->tclkConfig.initialize){
        for( i = 0; i< NUMBER_OF_TCLK_INPUTS; i++) {
            SIM_HAL_SetTClkFreq(SIM, i, simClockConfig->tclkConfig.tclkFreq[i]);
        }
    }

    /* Debug trace Clock settings. */
    if (simClockConfig->traceClockConfig.initialize) {
        SIM_HAL_InitTraceClock(SIM, &(simClockConfig->traceClockConfig));
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetScgClockFreq
 * Description   : This function returns the frequency of a given clock from SCG
 *
 *END**************************************************************************/
static clock_manager_error_code_t CLOCK_SYS_GetScgClockFreq(clock_names_t clockName,
                                                            uint32_t *frequency)
{
    clock_manager_error_code_t returnCode = CLOCK_MANAGER_SUCCESS;
    *frequency = 0U;

    switch (clockName)
    {
        /* Main clocks */
        case CORE_CLOCK:
            *frequency = SCG_HAL_GetSystemClockFreq(SCG,SCG_SYSTEM_CLOCK_CORE);
            break;
        case PLATFORM_CLOCK:
            *frequency = SCG_HAL_GetSystemClockFreq(SCG,SCG_SYSTEM_CLOCK_PLAT);
            break;
        case BUS_CLOCK:
            *frequency = SCG_HAL_GetSystemClockFreq(SCG,SCG_SYSTEM_CLOCK_BUS);
            break;
        case SLOW_CLOCK:
            *frequency = SCG_HAL_GetSystemClockFreq(SCG,SCG_SYSTEM_CLOCK_SLOW);
            break;

        /* Other internal clocks used by peripherals. */
        case SIRC_CLOCK:
            *frequency = SCG_HAL_GetSircFreq(SCG);
            break;
        case FIRC_CLOCK:
            *frequency = SCG_HAL_GetFircFreq(SCG);
            break;
        case SOSC_CLOCK:
            *frequency = SCG_HAL_GetSysOscFreq(SCG);
            break;
        case SPLL_CLOCK:
            *frequency = SCG_HAL_GetSysPllFreq(SCG);
            break;
        case RTC_CLKIN_CLOCK:
            *frequency = SCG_HAL_GetRtcClkInFreq(SCG);
            break;
        default:
            returnCode = CLOCK_MANAGER_NO_SUCH_CLOCK_NAME;
            break;
    }
    return returnCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetSimClockFreq
 * Description   : This function returns the frequency of a given clock from SIM
 *
 *END**************************************************************************/
static clock_manager_error_code_t CLOCK_SYS_GetSimClockFreq(clock_names_t clockName,
                                                            uint32_t *frequency)
{
    clock_manager_error_code_t returnCode = CLOCK_MANAGER_SUCCESS;
    *frequency = 0U;

