arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/clock/S32K144/fsl_clock_S32K144.c
    switch (clockName)
    {
        /* SIM clocks */
        case SIM_FTM0_CLOCKSEL:
            *frequency = SIM_HAL_GetTClkFreq(SIM,(uint8_t)SIM_HAL_GetFtmExternalClkPinMode(SIM, 0U));
            break;
        case SIM_FTM1_CLOCKSEL:
            *frequency = SIM_HAL_GetTClkFreq(SIM,(uint8_t)SIM_HAL_GetFtmExternalClkPinMode(SIM, 1U));
            break;
        case SIM_FTM2_CLOCKSEL:
            *frequency = SIM_HAL_GetTClkFreq(SIM,(uint8_t)SIM_HAL_GetFtmExternalClkPinMode(SIM, 2U));
            break;
        case SIM_FTM3_CLOCKSEL:
            *frequency = SIM_HAL_GetTClkFreq(SIM,(uint8_t)SIM_HAL_GetFtmExternalClkPinMode(SIM, 3U));
            break;
        case SIM_CLKOUTSELL:
            /* Check CLKOUT Select */
            switch (SIM_HAL_GetClkOutSel(SIM))
            {
                case SIM_CLKOUT_SEL_SYSTEM_OSC_CLK:
                    *frequency = SCG_HAL_GetSysOscFreq(SCG);
                    break;
                case SIM_CLKOUT_SEL_LPO_CLK:
                    *frequency = SIM_HAL_GetLpoFreq(SIM);
                    break;
                default:
                    /* Invalid CLKOUT selection.*/
                    returnCode = CLOCK_MANAGER_ERROR;
                    break;
            }
            break;

        case SIM_CLK32K_CLOCK:
            /* Check CLK32KSEL Select */
            switch (SIM_HAL_GetClock32kSrc(SIM))
            {
                case SIM_OSC32K_SEL_SIRCDIV2_CLK:
                    *frequency = SCG_HAL_GetSircAsyncFreq(SCG,SCG_ASYNC_CLOCK_DIV2);
                    break;
                case SIM_OSC32K_SEL_LPO_32K:
                    *frequency = SIM_HAL_GetLpo32KFreq(SIM);
                    break;
                case SIM_OSC32K_SEL_RTC_CLKIN:
                    *frequency = SCG_HAL_GetRtcClkInFreq(SCG);
                    break;
                case SIM_OSC32K_SEL_FIRCDIV2_CLK:
                    *frequency = SCG_HAL_GetFircAsyncFreq(SCG,SCG_ASYNC_CLOCK_DIV2);
                    break;
                default:
                    /* Invalid CLK32KSEL selection.*/
                    returnCode = CLOCK_MANAGER_ERROR;
                    break;
            }
            break;
        case SIM_LPO_CLOCK:
            *frequency = SIM_HAL_GetLpoFreq(SIM);
            break;
        case SIM_LPO_1K_CLOCK:
            *frequency = SIM_HAL_GetLpo1KFreq(SIM);
            break;
        case SIM_LPO_32K_CLOCK:
            *frequency = SIM_HAL_GetLpo32KFreq(SIM);
            break;
        default:
            returnCode = CLOCK_MANAGER_NO_SUCH_CLOCK_NAME;
            break;
    }
    return returnCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetPccClockFreq
 * Description   : This function returns the clock frequency of peripheral functional clock 
 *                 where applicable, otherwise the clock frequency of peripheral interface clock.
 *END**************************************************************************/
static clock_manager_error_code_t CLOCK_SYS_GetPccClockFreq(clock_names_t clockName,
                                                            uint32_t *frequency)
{
    clock_manager_error_code_t returnCode = CLOCK_MANAGER_SUCCESS;
    *frequency = 0U;

    /* Invalid PCC clock names */
    if (clockName <= SIM_END_OF_CLOCKS ||
        clockName == PCC_END_OF_BUS_CLOCKS ||
        clockName == PCC_END_OF_SYS_CLOCKS ||
        clockName == PCC_END_OF_ASYNCH_DIV1_CLOCKS ||
        clockName == PCC_END_OF_ASYNCH_DIV2_CLOCKS)
    {
        returnCode = CLOCK_MANAGER_NO_SUCH_CLOCK_NAME;
    }
    /* PCC clocks that are provided from BUS_CLK. 
     * These are peripheral interface clocks. */
    else if (clockName < PCC_END_OF_BUS_CLOCKS)
    {
        if (PCC_HAL_GetClockMode(PCC,clockName))  {
            *frequency = SCG_HAL_GetSystemClockFreq(SCG,SCG_SYSTEM_CLOCK_BUS);
        }
    }
    /* PCC clocks that are provided from SYS_CLK
     * These are peripheral interface clocks. */
    else if (clockName < PCC_END_OF_SYS_CLOCKS)
    {
        if (PCC_HAL_GetClockMode(PCC,clockName))  {
            *frequency = SCG_HAL_GetSystemClockFreq(SCG,SCG_SYSTEM_CLOCK_CORE);
        }
    }
    /* PCC clocks that are provided from asynchronous clocks 1th divider
     * These are peripheral functional clocks. */
    else if (clockName < PCC_END_OF_ASYNCH_DIV1_CLOCKS)
    {
        *frequency = CLOCK_SYS_GetPeripheralClock(clockName,SCG_ASYNC_CLOCK_DIV1);
    }
    /* PCC clocks that are provided from asynchronous clocks 2th divider
     * These are peripheral functional clocks. */
    else if (clockName < PCC_END_OF_ASYNCH_DIV2_CLOCKS)
    {
        *frequency = CLOCK_SYS_GetPeripheralClock(clockName,SCG_ASYNC_CLOCK_DIV2);
    }
    /* Invalid PCC clock names */
    else
    {
        returnCode = CLOCK_MANAGER_NO_SUCH_CLOCK_NAME;
    }
    return returnCode;
}




/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetFreq
 * Description   : This function returns the frequency of a given clock
 *
 *END**************************************************************************/
clock_manager_error_code_t CLOCK_SYS_GetFreq(clock_names_t clockName,
                                             uint32_t *frequency)
{
    clock_manager_error_code_t returnCode;

    /* Frequency of the clock name from SCG */
    if (clockName < SCG_END_OF_CLOCKS)
    {
        returnCode = CLOCK_SYS_GetScgClockFreq(clockName, frequency);
    }
    /* Frequency of the clock name from SIM */
    else if (clockName < SIM_END_OF_CLOCKS)
    {
        returnCode = CLOCK_SYS_GetSimClockFreq(clockName, frequency);
    }
    /* Frequency of the clock name from PCC */
    else if (clockName < PCC_END_OF_CLOCKS)
    {
        returnCode = CLOCK_SYS_GetPccClockFreq(clockName, frequency);
    }
    /* Invalid clock name */
    else
    {
        returnCode = CLOCK_MANAGER_NO_SUCH_CLOCK_NAME;
    }
    return returnCode;
}

/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_GetPeripheralClock
 * Description   : Internal function used by CLOCK_SYS_GetFreq function
 *END**************************************************************************/

static uint32_t CLOCK_SYS_GetPeripheralClock(clock_names_t clockName, scg_async_clock_type_t divider)
{
    uint32_t frequency = 0;
    peripheral_clock_frac_t  fracValue = PCC_HAL_GetFracValueSel(PCC,clockName);
    peripheral_clock_divider_t divValue = PCC_HAL_GetDividerSel(PCC,clockName);

    /* Check division factor */
    if (((uint32_t)fracValue) <= ((uint32_t)divValue))
    {
        /* Check clock gate */
        if (PCC_HAL_GetClockMode(PCC,clockName))
        {
            /* Check clock source */
            switch (PCC_HAL_GetClockSourceSel(PCC,clockName))
            {
                case CLK_SRC_SOSC:
                    frequency = SCG_HAL_GetSysOscAsyncFreq(SCG,divider);
                    break;
                case CLK_SRC_SIRC:
                    frequency = SCG_HAL_GetSircAsyncFreq(SCG,divider);
                    break;
                case CLK_SRC_FIRC:
                    frequency = SCG_HAL_GetFircAsyncFreq(SCG,divider);
                    break;
                case CLK_SRC_SPLL:
                    frequency = SCG_HAL_GetSysPllAsyncFreq(SCG,divider);
                    break;
                default:
                    frequency = 0;
            }      
            frequency = frequency / (divValue+1);
            frequency = frequency * (fracValue+1);
        }
    }
    return frequency;
}

/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_GetCurrentRunMode
 * Description   : Internal function used by CLOCK_SYS_SetScgConfiguration function
 *END**************************************************************************/
static scg_system_clock_mode_t CLOCK_SYS_GetCurrentRunMode(SMC_Type * smc_base) {
    scg_system_clock_mode_t mode;

    /* Read and convert from SMC run mode to SCG defines*/
    switch (SMC_HAL_GetPowerModeStatus(smc_base))
    {
        /* High speed run mode */
        case STAT_HSRUN:
            mode = SCG_SYSTEM_CLOCK_MODE_HSRUN;
            break;
        /* Run mode */
        case STAT_RUN:
            mode = SCG_SYSTEM_CLOCK_MODE_RUN;
            break;
        /* Very low power run mode */
        case STAT_VLPR:
            mode = SCG_SYSTEM_CLOCK_MODE_VLPR;
            break;
        /* This should never happen - core has to be in some run mode to execute code */
        default:
            mode = SCG_SYSTEM_CLOCK_MODE_NONE;
            break;
    }

    return mode;
}

/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_SwitchSystemClock
 * Description   : Internal function used by CLOCK_SYS_SetScgConfiguration function
 *END**************************************************************************/
static bool CLOCK_SYS_SwitchSystemClock(scg_system_clock_src_t to_clk) {
    scg_system_clock_config_t config;
    scg_system_clock_mode_t run_mode;

    /* Check destination clock */
    if ( to_clk != SCG_SYSTEM_CLOCK_SRC_NONE ) {

        /* Get & Convert Run mode from SMC to SCG defines*/
        run_mode = CLOCK_SYS_GetCurrentRunMode(SMC);

        if ( run_mode != SCG_SYSTEM_CLOCK_MODE_NONE ) {

            /* Read system clock configuration*/
            SCG_HAL_GetSystemClockConfig(SCG, run_mode, &config);

            /* Use to_clk as system clock source*/
            config.src = to_clk;

            /* Update run mode configuration */
            SCG_HAL_SetSystemClockConfig(SCG, run_mode, &config);

            /* Read new system clock configuration*/
            SCG_HAL_GetSystemClockConfig(SCG, SCG_SYSTEM_CLOCK_MODE_CURRENT, &config);

            if ( config.src == to_clk ) {
                   return true;
            }
        }
    }

    return false;
}
/*******************************************************************************
 * EOF
 ******************************************************************************/
